ProgessBase/InformationRegisters/ПРГ_СписокРассылкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_СписокРассылкиОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОстаткиОтпусков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныеЛистки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Юбиляры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриказОСверхурочке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыслугаЛет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗавершениеОтпускаПоУходуЗаРебенком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемыйОтпуск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИзменениеСтажаПоСевернымНадБавкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемУвольнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтуствующиеНаРаботе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОчисткаДатыОкончанияСрочногоТрудовогоДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабелиУчетаРабочегоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабелиУчетаРабочегоВремениВИП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадровыеПриказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОбОтпуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УведомлениеОЗавершенииИспытательногоСрока</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделенияОрганизаций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.АдресаПоставки</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AVTШтатноеРасписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVT_ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AVTШтатноеРасписаниеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVT_ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КадровоеПеремещениеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/CommonModules/ПРГ_Привилегированный/Ext/Module.bsl
//////////////////Отвправка табелей

 
Функция СформироватьТабель(ПодразделениеОрганизации,ДатаНачалаПериода,ДатаОкончанияПериода,СписокСотрудников=Неопределено)
	ФильтрСоответствия = Новый Соответствие;
	
	
	ФильтрСоответствия.Вставить("ДатаНачала", ДатаНачалаПериода);
	ФильтрСоответствия.Вставить("ДатаОкончания", ДатаОкончанияПериода);
	Если не СписокСотрудников=Неопределено тогда
		ФильтрСоответствия.Вставить("Работник", СписокСотрудников);
		ФильтрСоответствия.Вставить("ВидСравненияРаботника", ВидСравнения.ВСписке);
		ФильтрСоответствия.Вставить("ОтборРаботника", Истина);
	Иначе
		
		ФильтрСоответствия.Вставить("Подразделение", ПодразделениеОрганизации);
		ФильтрСоответствия.Вставить("ОтборПодразделения", ЗначениеЗаполнено(ПодразделениеОрганизации));
		ФильтрСоответствия.Вставить("ВидСравненияПодразделения", ВидСравнения.ВИерархии);
	Конецесли;
	ТабДокумент = Новый ТабличныйДокумент;	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Т13";
	ТабДокумент.АвтоМасштаб        = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.Очистить();
	
	Отчет = Отчеты.УнифицированнаяФормаТ13.Создать();
	
	Отчет.УстановитьФильтр(ФильтрСоответствия);
	ТекстОшибки = "";
	Отчет.СформироватьОтчет(ТабДокумент, "Табель", ТекстОшибки);
	///ТабДокумент=Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ТабДокумент.АвтоМасштаб=Истина;
	Если ТекстОшибки <> "" или ТабДокумент.ВысотаТаблицы=0 Тогда
		//РаботаСДиалогами.ВывестиПредупреждение(ТекстОшибки);
		Возврат Неопределено;
	Иначе
		Возврат ТабДокумент;
	КонецЕсли;
	
	
	
КонецФункции	


Функция получитьТекстЗапроса(отбор) экспорт
	
	возврат  "ВЫБРАТЬ
	|	ПРГ_СписокРассылкиОтчетов.ФизЛицо,
	|	ПРГ_СписокРассылкиОтчетов.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций,
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.ПРГ_СписокРассылкиОтчетов КАК ПРГ_СписокРассылкиОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ПРГ_СписокРассылкиОтчетов.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = значение(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|ГДЕ
	|	ПРГ_СписокРассылкиОтчетов."+отбор+"
	|ИТОГИ ПО
	|	ПодразделенияОрганизаций"
	
	
	
КонецФункции	

Процедура ОтправитьТабели(НачалоПериода,КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  получитьТекстЗапроса("ТабелиУчетаРабочегоВремени");
	
	Результат = Запрос.Выполнить();
	
	ВыборкаПодразделенияОрганизаций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделенияОрганизаций.Следующий() Цикл
		
		табДок=СформироватьТабель(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода,КонецДня(КонецПериода));
		
		ВыборкаДетальныеЗаписи = ВыборкаПодразделенияОрганизаций.Выбрать();
		СпсАдресатов=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпсАдресатов.Добавить(ВыборкаДетальныеЗаписи.Представление);
		КонецЦикла;
		если не табДок=Неопределено тогда
			сообщить(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций.код);
			
			имяфайла="";
			имяфайла=КаталогВременныхФайлов()+"Табель.PDF";
	        ТабДок.Записать(имяфайла,ТипФайлаТабличногоДокумента.PDF);
			//{23.06.2016 Островерхий заявка №б/н 
			ПредставлениеОрганизации = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Справочники.ПРГ_Служебный.ОрганизацияПоУмолчанию,Новый Структура("Наименование","Выразить(Объект КАК Справочник.Организации).Наименование")).Наименование; 
			//23.06.2016 Островерхий}
			ПРГ_Регламентый.ОправитьФайл("Табель по подразделению: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,СпсАдресатов,
			//"Табель по подразделению: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций +"
			//|
			//| Добрый день.
			//| Уважаемые коллеги, напоминаю, что срок  предоставления табеля учета рабочего времени:
			//| за первую половину месяца – 18 числа текущего месяца до 10-00,
			//| за месяц – последний рабочий день текущего месяца до 18-00
			//| 
			//| Оригинал табеля должен быть предоставлен в Липецк не позднее 14 дней с момента подписания.
			//| 
			//| Сроки прошу не нарушать.
			//| Обратите внимание, табель должен быть подписан как минимум 2 подписями – ответственным лицом (HR) и руководителем подразделения.
			//| Спасибо.
			//| 
            //Blik 290216 49617 убрала префиксы из эл ардреса
			"Добрый день!
			|Вам необходимо согласовать Табель учета рабочего времени работников Подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций+" 
			|
			|Для согласования необходимо проверить табель и переслать файл с подтверждением правильности заполнения и Вашего согласования HR-менеджеру  по e-mail:
			|
			|
			|Центральный офис,Дивизион Зарубежье					Кулькова Ирина(IKulkova@progressfood.ru)
			|Дивизион Центр,Московский филиал						Спирина Татьяна(TSpirina@progressfood.ru)
			|Дивизион Восток,Дивизион Урал,Дивизион Поволжье		Сорока Елена(ESoroka@progressfood.ru)
			|Дивизион Юг и ЦЧР										Лимонова Ольга(OLimonova@progressfood.ru)
			|СПб филиал												Попова Ольга(OBPopova@progressfood.ru)
			|Липецк													Баранова Екатерина(EBaranova@progressfood.ru)
			|
			|Установленный срок согласования:
			|- за первую половину месяца – до 14-00 мск  17 числа текущего месяца;
			|- за месяц – до 13-00 мск. первого числа следующего месяца. 
			|
			|Оригинал подписанного табеля за месяц предоставить в отдел кадрового документооборота и оплаты труда до 10го числа следующего месяца
			| С наилучшими пожеланиями, 
			| Толкачева Елена
			| руководитель отдела КДиОТ
			| "+ПредставлениеОрганизации+"
			| тел. (4742) 42-29-03"
			
			,имяфайла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОтправитьТабелиВИП(НачалоПериода,КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  получитьТекстЗапроса("ТабелиУчетаРабочегоВремениВИП");
	
	Результат = Запрос.Выполнить();
	
	ВыборкаПодразделенияОрганизаций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПодразделенияОрганизаций.Следующий() Цикл
		СписокСотрудников=получитьВипСотрудников(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода);
		если СписокСотрудников.Количество()=0 тогда Продолжить;КонецЕсли;
		
		табДок=СформироватьТабель(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,НачалоПериода,КонецДня(КонецПериода),СписокСотрудников);
		
		ВыборкаДетальныеЗаписи = ВыборкаПодразделенияОрганизаций.Выбрать();
		СпсАдресатов=Новый СписокЗначений;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпсАдресатов.Добавить(ВыборкаДетальныеЗаписи.Представление);
		КонецЦикла;
		если не табДок=Неопределено тогда
			имяфайла="";
			имяфайла=КаталогВременныхФайлов()+"Табель.PDF";
	        ТабДок.Записать(имяфайла,ТипФайлаТабличногоДокумента.PDF);
			//{23.06.2016 Островерхий заявка №б/н 
			ПредставлениеОрганизации = ПРГ_ДопФункцииКлиентСервер.ПолучитьРеквизитыОбъекта(Справочники.ПРГ_Служебный.ОрганизацияПоУмолчанию,Новый Структура("Наименование","Выразить(Объект КАК Справочник.Организации).Наименование")).Наименование; 
			//23.06.2016 Островерхий} 
			
			ПРГ_Регламентый.ОправитьФайл("Табель по вип сотрудникам подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций,СпсАдресатов,
			//Blik 290216 49617 убрала префиксы из эл ардреса
			"Добрый день!
			|Вам необходимо согласовать Табель учета рабочего времени работников Подразделения: "+ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций+" 
			|
			|Для согласования необходимо проверить табель и переслать файл с подтверждением правильности заполнения и Вашего согласования HR-менеджеру  по e-mail:
			|
			|
			|Центральный офис,Дивизион Зарубежье					Кулькова Ирина(IKulkova@progressfood.ru)
			|Дивизион Центр,Московский филиал						Спирина Татьяна(TSpirina@progressfood.ru)
			|Дивизион Восток,Дивизион Урал,Дивизион Поволжье		Сорока Елена(ESoroka@progressfood.ru)
			|Дивизион Юг и ЦЧР										Лимонова Ольга(OLimonova@progressfood.ru)
			|СПб филиал												Попова Ольга(OBPopova@progressfood.ru)
			|Липецк													Баранова Екатерина(EBaranova@progressfood.ru)
			|
			|Установленный срок согласования:
			|- за первую половину месяца – до 14-00 мск  17 числа текущего месяца;
			|- за месяц – до 13-00 мск. первого числа следующего месяца. 
			|
			|Оригинал подписанного табеля за месяц предоставить в отдел кадрового документооборота и оплаты труда до 10го числа следующего месяца
			| С наилучшими пожеланиями, 
			| Толкачева Елена
			| руководитель отдела КДиОТ
			| "+ПредставлениеОрганизации+"
			| тел. (4742) 42-29-03"


			,имяфайла);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

/////Вадим 02.07.2013 8:34:20
Функция получитьВипСотрудников(ПодразделенияОрганизаций,ДатаСреза)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник,
	|	ЗначенияСвойствОбъектов.Значение
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Дата, ) КАК РаботникиОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство В
	|				(ВЫБРАТЬ
	|					СвойстваОбъектов.Ссылка
	|				ИЗ
	|					ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|				ГДЕ
	|					СвойстваОбъектов.Наименование = ""ВипСотрудник""))
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	И РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ(&ПодразделениеОрганизации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.Значение = ИСТИНА";
	Запрос.УстановитьПараметр("Дата", ДатаСреза);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПодразделенияОрганизаций);
	
	Результат = Запрос.Выполнить();
	возврат Результат.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	

	

КонецФункции 
// получитьВипСотрудников(ВыборкаПодразделенияОрганизаций.ПодразделенияОрганизаций);() ВадимКонец

//начало изменений Ожиганов А. 21.03.2017 63517 блокировка редактирования справочника серии из формы 
Функция ПРГ_ОпределитьестьлиСпецДоктыПоСерии(СерияНоменклатуры) Экспорт
	Запрос = Новый запрос("ВЫБРАТЬ
	                      |	СУММА(КолВоДоков.КолВо) КАК КолВо
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*) КАК КолВо
	                      |	ИЗ
	                      |		Документ.ВыпускПродукции.Продукция КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ОтчетПроизводстваЗаСмену.Продукция КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ОтчетПроизводстваЗаСмену.Материалы КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КОЛИЧЕСТВО(*)
	                      |	ИЗ
	                      |		Документ.ПеремещениеТоваров.Товары КАК Док
	                      |	ГДЕ
	                      |		Док.СерияНоменклатуры = &СерияНоменклатуры
	                      |		И Док.Ссылка.Проведен
	                      |		И Док.Ссылка.ОтражатьВБухгалтерскомУчете) КАК КолВоДоков");
						  
	КолВодоков = 0;
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		КолВодоков = Выборка.КолВо;
	КонецЕсли;	
	
	возврат ?(КолВодоков>0,Истина,Ложь);
	
КонецФункции	
//конец изменений
